app/controllers/administrators_controller.rb

SELECT "administrators".* FROM "administrators"
---
    def index
        admins = Administrator.all