app/controllers/interviews_controller.rb

SELECT "interviews".* FROM "interviews"
---
    def index
        interview = Interview.all

SELECT "volunteers".* FROM "volunteers" WHERE "volunteers"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "administrators".* FROM "administrators"
INSERT INTO "interviews" ("date", "time", "volunteer_id", "administrator_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["date", "2020-11-02"], ["time", "15:00"], ["volunteer_id", 6], ["administrator_id", 1]]
INSERT INTO "interviews" ("date", "time", "volunteer_id", "administrator_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["date", "2020-11-02"], ["time", "15:30"], ["volunteer_id", 5], ["administrator_id", 1]]
---
    def create
        volunteerObj = Volunteer.find(params[:volunteer_id])
        admin = Administrator.all[0]
        interview = Interview.create!(date: params[:date], time: params[:time], volunteer: volunteerObj, administrator: admin)
        if interview.save

SELECT "interviews".* FROM "interviews" WHERE "interviews"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "interviews" SET "date" = $1, "time" = $2, "notes" = $3 WHERE "interviews"."id" = $4  [["date", ""], ["time", ""], ["notes", "He was an excellent candidate. Enjoyed our conversation. Would be great in ChildLife."], ["id", 5]]
---
    def update
        interview = Interview.find(params[:id])
        interview.update!(interview_params)