app/controllers/meetings_controller.rb

    def index
        meetings = Meeting.all
---
SELECT "meetings".* FROM "meetings"

    def create
        volun = Volunteer.find_by(id: params[:volunteer])
        meeting = Meeting.create!(volunteer: volun, date: params[:date], time: params[:time], link: params[:link], patient_name: params[:patient_name], patient_age: params[:patient_age], patient_info: params[:patient_info])
        if meeting.save
---
SELECT "volunteers".* FROM "volunteers" WHERE "volunteers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "meetings" ("date", "time", "patient_name", "patient_age", "patient_info", "volunteer_id", "link", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
UPDATE "volunteers" SET "approved" = $1, "updated_at" = $2 WHERE "volunteers"."id" = $3  [["approved", true], ["updated_at", "2020-11-10 22:52:15.848807"], ["id", 6]]

    def update
        meeting = Meeting.find(params[:id])
        meeting.update!(meeting_params)
---
SELECT "meetings".* FROM "meetings" WHERE "meetings"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "meetings" SET "notes" = $1, "updated_at" = $2 WHERE "meetings"."id" = $3  [["notes", "She was great."], ["updated_at", "2020-11-03 16:47:15.872826"], ["id", 5]]