app/controllers/volunteers_controller.rb

SELECT "volunteers".* FROM "volunteers"
---
    def index
        vols = Volunteer.all

INSERT INTO "volunteers" ("name", "age", "email", "password", "approved", "profile_image", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
    def create
        vol = Volunteer.create!(vol_params)
        if vol.save

SELECT "volunteers".* FROM "volunteers" WHERE "volunteers"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
UPDATE "volunteers" SET "age" = $1, "profile_image" = $2, "updated_at" = $3 WHERE "volunteers"."id" = $4  [["age", 29], ["profile_image", "http://res.cloudinary.com/childlifeappmod5project/image/upload/v1605055932/exlreekiyo36czms5ntb.jpg"], ["updated_at", "2020-11-11 00:52:17.410593"], ["id", 1]]
UPDATE "volunteers" SET "approved" = $1, "updated_at" = $2 WHERE "volunteers"."id" = $3  [["approved", true], ["updated_at", "2020-10-31 22:12:05.411405"], ["id", 13]]
---
    def update
        vol = Volunteer.find(params[:id])
        vol.update!(vol_params)
        if vol.save

SELECT "volunteers".* FROM "volunteers" WHERE "volunteers"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "volunteers" WHERE "volunteers"."id" = $1  [["id", 6]]
---
    def destroy
        vol = Volunteer.find(params[:id])
        vol.destroy